TexasInstruments/mcu_plus_sdk_am263x/source/security/security_common/drivers/hsmclient/hsmclient.h
/*
 *  Copyright (C) 2022-24 Texas Instruments Incorporated
 *
 *  Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions
 *  are met:
 *
 *    Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the
 *    distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 *  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 *  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 *  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
 *  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 *  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 *  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 *  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 *  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 *  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 *  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef HSM_CLIENT_H_
#define HSM_CLIENT_H_

#ifdef __cplusplus
extern "C"
{
#endif

/* Header file for HSM client driver */
#include <stdint.h>
#include <security_common/drivers/secure_ipc_notify/sipc_notify.h>
#include <security_common/drivers/hsmclient/hsmclient_msg.h>
#include <security_common/drivers/hsmclient/utils/hsmclient_utils.h>
#include <kernel/dpl/SemaphoreP.h>

/**
 * \defgroup DRV_HSMCLIENT_MODULE APIs for HSMCLIENT
 * \ingroup DRV_MODULE
 *
 * See \ref DRIVERS_HSMCLIENT_PAGE for more details.
 *
 * @{
 */
#define LABEL_AND_CONTEXT_LEN_MAX 48U

#if defined(SOC_AM263X)|| defined(SOC_AM263PX)|| defined(SOC_AM261X)
/**
 * @brief
 *        Enable or disable staging of HSM IPC structs through the
 *        driver-owned host buffer (gHsmClientHostBuff) inside
 *        HsmClient_getIPCBuffPtr() / HsmClient_syncIPCBuffPtr().
 */
#define HSMCLIENT_HOST_BUFF_ENABLE

/**
 * @brief
 *        Enable or disable cache writeback/invalidate operations for HSM IPC
 *        buffers.  Set to 1 (default) to enable cache maintenance; set to 0
 *        to disable all CacheP_wbInv / CacheP_inv calls in the HSM client
 *        driver.  Disabling is useful when HSM IPC buffers are placed in
 *        non-cacheable memory by the application linker script.
 *
 *        To disable, define HSMCLIENT_CACHE_ENABLE=0 in the compiler flags
 *        before including this header, or override it in a project-level
 *        config header.
 */
#define HSMCLIENT_CACHE_ENABLE  (1U)
#endif

/**
 * @brief
 *        Size in bytes of the driver-owned host buffer used by
 *        HsmClient_prepareHostBuff().  Sized to accommodate the largest
 *        HSM IPC struct (OTFA_Config_t ~228 bytes), rounded up to a
 *        multiple of the cache line size.
 */
#define HSMCLIENT_HOST_BUFF_SIZE  (512U)

/**
 * @brief
 *        HSMRT load has not been requested
 */
#define HSMRT_LOAD_NOT_REQUESTED (0U)
/**
 * @brief
 *        HSMRT load has been requested
 */
#define HSMRT_LOAD_REQUESTED (1U)
/**
 * @brief
 *        HSMRT load has failed
 */
#define HSMRT_LOAD_FAILED (2U)
/**
 * @brief
 *        HSMRT load has succeeded
 */
#define HSMRT_LOAD_SUCCEEDED (3U)

/* 
 * -------------------------------------------------------------------------
 * Algorithm selectors — used in CryptoServiceReq_t.algoId
 * -------------------------------------------------------------------------
 */
/** @brief Algorithm: AES-CMAC */
#define HSM_CRYPTO_SVC_MAC_CMAC  (0x0001U)
/** @brief Algorithm: HMAC */
#define HSM_CRYPTO_SVC_MAC_HMAC  (0x0002U)
/** @brief Algorithm: GMAC */
#define HSM_CRYPTO_SVC_MAC_GMAC  (0x0003U)

/* 
 * -------------------------------------------------------------------------
 * Hash mode selectors for HMAC — used in HMACArgs_t.hashMode
 * -------------------------------------------------------------------------
 */
/** @brief HMAC with SHA-256 (32-byte tag) */
#define HSM_CRYPTO_HMAC_SHA256  (0x6U)  /* matches DTHE_SHA_ALGO_SHA256 */
/** @brief HMAC with SHA-512 (64-byte tag) */
#define HSM_CRYPTO_HMAC_SHA512  (0x4U)  /* matches DTHE_SHA_ALGO_SHA512 */

/* 
 * -------------------------------------------------------------------------
 * Sub-service selectors — used in CryptoServiceReq_t.subSvcId
 * -------------------------------------------------------------------------
 */
/** @brief MAC: compute tag and write to ptrTag (used for CMAC, HMAC, GMAC) */
#define HSM_CRYPTO_SVC_MAC_GENERATE  (0x0001U)
/** @brief MAC: compute tag and compare against ptrTag (used for CMAC, HMAC, GMAC) */
#define HSM_CRYPTO_SVC_MAC_VERIFY    (0x0002U)

/* 
 * -------------------------------------------------------------------------
 * Service macros — used in DeviceConfigRead_t
 * -------------------------------------------------------------------------
 */
/** @brief Safety configuration (dedFotaInfo, hsmPbistStatus) */
#define DEVICE_CONFIG_TYPE_SAFETY       (0U)

/** @brief Security configuration (SecCfg validation, SW revisions, boot retry counts) */
#define DEVICE_CONFIG_TYPE_SECURITY     (1U)

/** @brief Debug configuration (TBD) */
#define DEVICE_CONFIG_TYPE_DEBUG        (2U)

/** @brief Keyring configuration (auxiliary key import status) */
#define DEVICE_CONFIG_TYPE_KEYRING      (3U)

/** @brief All configuration types */
#define DEVICE_CONFIG_TYPE_ALL          (0xFFU)

/** @brief Size of Safety configuration data in bytes (2 uint32_t values) */
#define SIZE_OF_SAFETY_DEVICE_CONFIG       (8U)

/** @brief Size of security configuration data in bytes (11 uint32_t values) */
#define SIZE_OF_SECURITY_DEVICE_CONFIG     (44U)

/** @brief Size of Debug configuration data in bytes (4 uint32_t values) */
#define SIZE_OF_DEBUG_DEVICE_CONFIG        (16U)

/** @brief Size of Keyring configuration data in bytes (5 uint32_t values) */
#define SIZE_OF_KEYRING_DEVICE_CONFIG      (20U)

    /**
     * @brief
     * type for reading HSMRt version.
     *
     */
    typedef union HsmVer_t_
    {
        uint64_t HsmrtVer /**< A 64 bit unique Version number */;
        struct
        {
            uint8_t PatchVer; /** patch Version number refer HSMRT_PATCH_VER in TIFS Docs  */
            uint8_t MinorVer; /** HSMRt minor version number refer HSMRT_MINOR_VER in TIFS Docs*/
            uint8_t MajorVer; /** HSMRt major version number refer HSMRT_MAJOR_VER in TIFS Docs*/
            uint8_t ApiVer;   /** HSMRt API version number refer HSMRT_APIS_VER in TIFS Docs*/
            uint8_t SocType;  /** HSMRt Soc type ID refer HSMRT_SOC_TYPE in TIFS Docs*/
            uint8_t BinType;  /** HSMRt Binary type ID refer HSMRT_BIN_TYPE in TIFS Docs*/
            uint8_t HsmType;  /** HSM Architecture version */
            uint8_t DevType;  /** HSMRt Device type ID  refer HSMRT_DEVICE_TYPE in TIFS Docs*/

