TexasInstruments/mcu_plus_sdk_am263x/source/security/security_common/drivers/hsmclient/hsmclient.h
        } VerStruct;
#if defined(_TMS320C6X)
    } __attribute__((packed)) HsmVer_t_;
#else
} __attribute__((packed)) HsmVer_t;
#endif

    /**
     * @brief
     * This is a HSMClient type which holds the information
     * needed by hsm client to communicate with HSM .
     */
    typedef struct HsmClient_t_
    {
        SemaphoreP_Object Semaphore; /**  Registered client will pend of this semaphore
                                       till it receives a response from HSM server. */
        HsmMsg_t ReqMsg;             /** message frame that is to be passed to HSM server.*/
        HsmMsg_t RespMsg;            /** Stores a message frame received from HSM server.*/
        uint8_t RespFlag;            /** Indicates weather a request has been Acked or Nacked by HSM server.*/
        uint8_t ClientId;            /** object's ClientId.*/

    } HsmClient_t;

    /**
     * @brief
     * This is an NvmOtpRead type which holds the information
     * of NvmOtp row index and row data corresponding to it .
     * For F29H85x, the rowdIdx corresponds to the Flash Offsets.
     * For AM26x, the rowIdx corresponds to efuse row offsets.
     */
    typedef struct NvmOtpRead_t_
    {
        uint32_t rowData; /** Points to data retrieved from gp otp registers or fw otp region.*/
        uint16_t rowIdx;  /** Points index of an NvmOtp row to be read.*/
        uint8_t rsvd[2];  /** Reserved **/
    } NvmOtpRead_t;

    /**
     * @brief
     * This is an NvmOtpRowWrite type which holds the information
     * regarding programming NvmOtp row.
     * For F29H85x, the rowdIdx corresponds to the Flash Offsets.
     * For AM26x, the rowIdx corresponds to efuse row offsets.
     */
    typedef struct NvmOtpRowWrite_t_
    {
        uint32_t rowData;    /** Data to be written in an NvmOtp row **/
        uint32_t rowBitMask; /** Bit mask to apply to an NvmOtp row data bits **/
        uint16_t rowIdx;     /** Index of an NvmOtp row. **/
        uint8_t rsvd[2];     /** Reserved **/
    } NvmOtpRowWrite_t;

    /**
     * @brief
     * This is an NvmOtpRowCount type which holds the information
     * regarding NvmOtp row count and size of each row in bits.
     */
    typedef struct NvmOtpRowCount_t_
    {
        uint32_t rowCount; /** NvmOtp row count **/
        uint8_t rowSize;   /** Size of an NvmOtp row in bits. **/
        uint8_t rsvd[3];   /** Reserved **/
    } NvmOtpRowCount_t;

    /**
     * @brief
     * This is a NvmOtpRowProt type which holds the information
     * of NvmOtp row index and protection status corresponding
     * to the row index.
     * This structure is not valid for f29h85x
     */
    typedef struct NvmOtpRowProt_t_
    {
        uint16_t rowidx;   /** Index of an NvmOtp row. **/
        uint8_t readProt;  /** Read row protection information used in getting or setting an NvmOtp row protection. **/
        uint8_t writeProt; /** Write row protection information used in getting or setting an NvmOtp row protection. **/
    } NvmOtpRowProt_t;

    /**
     * @brief
     * This is a keywriter_cert_header type which holds the information
     * of customer key certificate and debug responce.
     */
    typedef struct keywriter_cert_header_t_
    {
        uint8_t *certAddress;   /*For holding cerificate address*/
        uint32_t certSize;      /*Cerificate size*/
        uint32_t debugResponse; /*Debug response*/
        uint32_t reserved;      /*reserved for future use*/
    } KeyWriterCertHeader_t;

    /**
     * @brief
     * This is a FirewallRegionReq type which holds the information
     * of Firewall region configuration.
     */
    typedef struct FirewallRegionReq_t_
    {
        uint16_t firewallId;           /**< Index of the firewall. **/
        uint16_t region;               /**< Region number **/
        uint32_t permissionAttributes; /**< Memory Protection Permission Attributes corresponding to the firewall **/
        uint32_t startAddress;         /**< Start Address of the region **/
        uint32_t endAddress;           /**< End Address of the region **/
    } FirewallRegionReq_t;

    /**
     * @brief
     * This is a FirewallReq_t type which holds the information
     * of Firewall configuration.
     */
    typedef struct FirewallReq_t_
    {
        uint16_t regionCount;                   /**< Region count **/
        uint16_t crcArr;                        /**< crc of FirewallRegionArr **/
        FirewallRegionReq_t *FirewallRegionArr; /**< Array containing set firewall region request **/
        uint16_t statusFirewallRegionArr;       /**< Status of all region requests **/
    } FirewallReq_t;

    /**
     * @brief
     * This is a FirewallIntrReq type which holds the information
     * of MPU Firewall request for interrupt enable, interrupt enable clear,
     * interrupt enable status clear and fault clear.
     */
    typedef struct FirewallIntrReq_t_
    {
        uint16_t firewallId;                /**< Index of the firewall. **/
        uint8_t interruptEnable;            /**< MPU Interrupt Enable **/
        uint8_t interruptEnableClear;       /**< Clear MPU Interrupt **/
        uint8_t interruptEnableStatusClear; /**< Clear raw status **/
        uint8_t faultClear;                 /**< Clear voilation status MMRs **/
    } FirewallIntrReq_t;

    /**
     * @brief
     * This is SWRev type which holds the information
     * regarding Revision identifier and value corresponding to it .
     *
     * @param revValue  stores software revision value retreived from sec manager.
     * @param revId    revision identifier
     * @param rsvd     reserved for future use.
     */
    typedef struct SWRev_t_
    {
        uint32_t revValue; /**< Value for sw rev retreived from sec manager.*/
        uint8_t revId;     /**< revision identifier*/
        uint8_t rsvd[3];   /**< Reserved */
    } SWRev_t;

    /**
     * @brief
     * This is DKEK type which holds the label and context for derivation.
     * This also holds the 256 derived KEK value which is returned by TIFS.
     *
     * @param label_length		length of label.
     * @param context_length	length of context
     * @param label_and_context holds the label and context as an array
     * @param dkek				holds the derived key as returned by TIFS.
     */
    typedef struct DKEK_t_
    {
        uint8_t label_length;                                 /**< label length.*/
        uint8_t context_length;                               /**< context length.*/
        uint8_t label_and_context[LABEL_AND_CONTEXT_LEN_MAX]; /**< label_and_context array */
        uint32_t dkek[8];                                     /**< derived KEK. */
    } DKEK_t;

    /**
     * @brief
     * This is RNG type which holds the resultPtr for derivation which is returned by TIFS.
     * This also holds the resultLength and DRBG Mode along with seedValue and seedSize.
     *
     * @param resultPtr		    Pointer to the random number generated
     * @param resultLength	    Length in bytes
     * @param DRBGMode          Flag that determines whether DRBG mode is required or not
     * @param seedValue			Stores the seed values
     * @param seedSizeInDWords   Stores the seed size in double words
     */
    typedef struct RNGReq_t_
    {
        uint8_t *resultPtr;        /**< Pointer to the random number.*/
        uint32_t resultLength;    /**< Length in bytes.*/
        uint8_t DRBGMode;          /**< Flag to enable DRBG Mode.*/
        uint32_t *seedValue;       /**< Seed Value.*/
        uint8_t seedSizeInDWords;  /**< Seed Size in double words.*/
        uint8_t reserved;          /**< Reserved Variable.*/
    } RNGReq_t;

    /**
     * @brief
     * This is the SecureBoot Stream type which holds the data for a specific bootloader
     * to HSM call. This packet is needed by HSM the to do the required operation.
     */
    typedef struct SecureBoot_Stream_t_
    {
        uint8_t *dataIn;        /**< Pointer to the data in shared memory.*/
        uint32_t dataLen;       /**< Size of the data.*/
        uint8_t canBeEncrypted; /**< Whether this data could be encrypted or not.*/
    } __attribute__((packed)) SecureBoot_Stream_t;

    /**
     * @brief
     * This is Firmware Update request structure passed to HSM core via SIPC as
     * argument, these parameters are required by the service handler
     *
     * @param pStartAddress               Pointer to the start address of data to be programmed in flash
     * @param dataLength                  Length of data to be programmed in flash
     * @param pDecryptionBuffer           Address of Scratchpad memory to be used to decrypt 
     *                                    image, valid only for HsmClient_firmwareUpdate_CodeVerify API
     * @param decryptionBufferLength      Length of Scratchpad memory to be used to decrypt image, 
     *                                    valid only for HsmClient_firmwareUpdate_CodeVerify API 
     */
    typedef struct FirmwareUpdateReq_t_
    {
        uint8_t *pStartAddress;             /* Start address of data to be programmed in flash memory */
        uint32_t dataLength;                /* Length of data to be programmed in flash memory */
        void *pDecryptionBuffer;            /* Address of Scratchpad memory to be used to decrypt image, valid only for HsmClient_firmwareUpdate_CodeVerify API */
        uint32_t decryptionBufferLength;    /* Length of Scratchpad memory to be used to decrypt image, valid only for HsmClient_firmwareUpdate_CodeVerify API */
    } FirmwareUpdateReq_t;


/**
 * @brief
 * This is the OTFA Region structure which holds individual region specific information to be written to corresponding OTFA registers.
 * In AM263Px and AM261x, there are 4 OTFA regions
 */
typedef struct OTFA_Region_t
{
    uint8_t   authMode ;         /* mode of authentication - disable-0/GMAC-1/CMAC-2 ; */
    uint8_t   encMode ;          /* mode of decryption - disable-0 or AES_CTR-1 */
    uint16_t  reservedArea ;     /* reserved to align with 4kB structure */
    uint32_t  regionStAddr ;     /* start address of the flash region for which the configuration should apply */
    uint32_t  regionSize ;       /* size of the flash region in kB for which the configuration should apply */
    uint8_t   authKeyID ;        /* Keyring ID of key to be used for authentication */    
    uint8_t   encrKeyID ;        /* Keyring ID of key to be used for encryption */
    uint8_t   encrKeyFetchMode ; /* specify which 16 bytes of DSMEK are to be used - 1 for fist 16/2 for last 16/ 3 for XOR of both */
    uint8_t   authAesKey [16] ;  /* actual key value to be written to the register for authentication ; fetched from keyring */
    uint8_t   encrAesKey [16] ;  /* actual key value to be written to the register for decryption ; fetched from keyring */
    uint8_t   regionIV[16] ;     /* IV to be used for encryption */
} OTFA_Region_t;

/**
 * @brief
 * This is the OTFA Region structure which holds individual region specific information to be read from OTFA registers.
 */
typedef struct OTFA_readRegion_t
{
    uint8_t   regionNumber ;    /* Index of the region - 0/1/2/3 */
    uint8_t   authMode ;        /* mode of authentication - disable-0/GMAC-1/CMAC-2 ; */
    uint8_t   encMode ;         /* mode of decryption - disable-0 or AES_CTR-1 */
    uint8_t   authKeyHash[64] ; /* hash of the authentication key stored in OTFA register */
    uint8_t   encKeyHash[64] ;  /* hash of the encryption key stored in OTFA register */
    uint32_t  regionStAddr ;    /* start address of the flash region for which the configuration should apply */
    uint32_t  regionSize ;      /* size of the flash region in kB for which the configuration should apply */
    uint16_t  regionIV[16] ;    /* IV to be used for encryption */
} OTFA_readRegion_t;

/**
 * @brief
 * This is the entire OTFA structure which holds all regions' information 
 * 4 regions in AM263Px and AM261x
 */
typedef struct OTFA_Config_t
{
    OTFA_Region_t  OTFA_Reg[4] ;    /* array of all registers' information of 4 OTFA Regions */
    uint8_t        numRegions ;     /* number of OTFA regions to be configured */
    uint8_t        keySize   ;      /* options - 128/256 */
    uint8_t        macSize   ;      /* options - 4/8/12/16 */
    uint8_t        masterEnable ;   /* specifies whether OTFA IP has to be enabled/disabled ; 0 or 1 */
} OTFA_Config_t;

/**
* @brief
* This is Sec-Cfg validation request structure passed to HSM core via SIPC as
* argument, these parameters are required by the service handler.
* Valid only for F29x family of devices
*
* @param pCertAddress               Pointer to the Sec-Cfg certificate, if argument passed is NULL, HSM validates Sec-Cfg from default location
* @param certType                   Sec-Cfg certificate for C29 CPU1, CPU2 or CPU3
*/
typedef struct SecCfgValidate_t_
{
    uint8_t *pCertAddress;  /** Address of the Sec-Cfg certificate, if NULL default Sec-cfg is validated */
    uint32_t certType;      /** Sec-Cfg certificate for CPU1, CPU2 or CPU-3, pass NULL if validating 
                             * sec-cfg not programmed in device Sec-Cfg memory 
                             */
} SecCfgValidate_t;

/**
* @brief
* This is active bank to dormant bank copy request structure 
* passed to HSM core via SIPC as argument, these parameters 
* are required by the service handler.
* Valid only for F29x family of devices
*
* @param cpuFlashBankType          C29 CPU1, C29 CPU3 or HSM CPU image that is to be copied 
*                                  to dormant bank from current active bank
*/
typedef struct FlashBankCopy_t_
{
    uint8_t cpuFlashBankType;  /** CPU for which this service is invoked */
} FlashBankCopy_t;

/**
 * @brief
 * Outer request struct for HSM_MSG_CRYPTO_SERVICE.
 * Note: These services are only available in HSSE mode
 *
 * @param algoId     Algorithm selector: HSM_CRYPTO_SVC_MAC_CMAC, etc.
 * @param subSvcId   Operation selector: HSM_CRYPTO_SVC_MAC_GENERATE, etc.
 * @param keyId      Symmetric key index in the HSM keyring (CRC protected).
 * @param errCode    Error code returned by the HSM Crypto Wrapper on response.
 * @param ptrArgs    Pointer to the algorithm-specific args struct.
 */
typedef struct CryptoServiceReq_t_
{
    uint32_t  algoId;     /**< Algorithm selector: HSM_CRYPTO_SVC_MAC_* */
    uint32_t  subSvcId;   /**< Operation selector: HSM_CRYPTO_SVC_MAC_GENERATE/VERIFY */
    uint32_t  keyId;      /**< Symmetric key index in the keyring (CRC protected) */
    uint32_t  errCode;    /**< Error code returned by HSM Crypto Wrapper */
    void     *ptrArgs;    /**< Algorithm-specific args struct pointer */
} CryptoServiceReq_t;

/**
 * @brief
 * Args for CMAC generate and verify
 * Note: These services are only available in HSSE mode
 *
 * Generate: on return ptrTag holds the full 16-byte AES-CMAC output.
 * Verify:   ptrTag must contain the expected 16-byte tag.
 *           ACK if tags match, NACK otherwise.
 *
 * @param ptrData  Pointer to input data in shared memory
 * @param dataLen  Length of input data in bytes
 * @param ptrTag   Pointer to 16-byte tag buffer (output for generate,
 *                 expected tag for verify)
 */
typedef struct CMACArgs_t_
{
    uint8_t  *ptrData;   /**< Pointer to input data in shared memory */
    uint32_t  dataLen;   /**< Input data length in bytes */
    uint8_t  *ptrTag;    /**< Pointer to 16-byte MAC tag */
} CMACArgs_t;

/**
 * @brief
 * Args for HMAC generate and verify
 * Note: These services are only available in HSSE mode
 *
 * Generate: on return ptrTag holds the HMAC output
 *           (32 bytes for SHA-256, 64 bytes for SHA-512).
 * Verify:   ptrTag must contain the expected tag.
 *           ACK if tags match, NACK otherwise.
 *
 * @param hashMode Hash mode: HSM_CRYPTO_HMAC_SHA256 or HSM_CRYPTO_HMAC_SHA512
 * @param ptrData  Pointer to input data in shared memory
 * @param dataLen  Length of input data in bytes
 * @param ptrTag   Pointer to MAC tag buffer (32 bytes for SHA-256, 64 bytes for SHA-512)
 */
typedef struct HMACArgs_t_
{
    uint32_t  hashMode;  /**< Hash mode selector: SHA-256 or SHA-512 */
    uint8_t  *ptrData;   /**< Pointer to input data in shared memory */
    uint32_t  dataLen;   /**< Input data length in bytes */
    uint8_t  *ptrTag;    /**< Pointer to MAC tag buffer */
} HMACArgs_t;

/**
 * @brief
 * Args for GMAC generate and verify
 * Note: These services are only available in HSSE mode
 * 
 * Generate: on return ptrTag holds the full 16-byte GMAC output.
 * Verify:   ptrTag must contain the expected 16-byte tag.
 *           ACK if tags match, NACK otherwise.
 *
 * @param ptrData  Pointer to input data in shared memory
 * @param dataLen  Length of input data in bytes
 * @param ptrTag   Pointer to 16-byte tag buffer
 * @param ptrIV    Pointer to IV buffer
 * @param ivLen    Length of IV in bytes
 */
typedef struct GMACArgs_t_
{
    uint8_t  *ptrData;   /**< Pointer to input data in shared memory */
    uint32_t  dataLen;   /**< Input data length in bytes */
    uint8_t  *ptrTag;    /**< Pointer to 16-byte tag buffer */
    uint8_t  *ptrIV;     /**< Pointer to IV buffer */
    uint32_t  ivLen;     /**< IV length in bytes */
} GMACArgs_t;

/**
 * @brief
 * This is bank swap request structure passed to HSM core via SIPC as
 * argument, these parameters are required by the service handler.
 * Valid only for F29x family of devices
 *
 * @param c29CpuId               C29 CPU for which flash banks are to be swapped
 * @param syncFlag               Synchronisation flag, HSM waits for this flag to be set to 
 *                               a specific value within a given time period, post which HSM
 *                               swaps the flash banks
 * @param timeout                Timeout period for which HSM is supposed to wait
 * @param c29CpuBankSwapVal      C29 CPU bankswap register value read before making swap 
 *                               request to HSM, used by C29 CPU only
 */
typedef struct BankSwapReq_t_
{
    uint8_t c29CpuId;           /** C29 CPU for which flash banks are to be swapped */
    uint8_t syncFlag;           /** Synchronisation flag used by HSM to initiate bank swap */
    uint32_t timeout;           /** Timeout period for which HSM is supposed to wait
                                    before exiting server function */
    uint32_t c29CpuBankSwapVal; /** C29 CPU bankswap register value before making swap request to HSM */
} BankSwapReq_t;

