TexasInstruments/mcu_plus_sdk_am263x/source/security/security_common/drivers/hsmclient/hsmclient.h
/*
 * @brief
 * Safety configuration structure containing safety-related device information.
 * Total size: SIZE_OF_SAFETY_DEVICE_CONFIG (8 bytes)
 */
typedef struct DeviceConfigSafety_t_
{
    uint32_t dedFotaInfo;      /** DED error info in HSM FOTA active bank determination */
    uint32_t hsmPbistStatus;   /** HSM PBIST status information */
} DeviceConfigSafety_t;

/**
 * @brief
 * Security configuration structure containing security-related device information.
 *
 * Layout (in wire order, each field is uint32_t unless noted):
 *   [F29H85X only]  c29Cpu2SecCfgValidationStatus
 *   [F29H85X only]  c29Cpu3SecCfgValidationStatus
 *   [F29P32X only]  c29Cpu2SecCfgValidationStatus
 *   certSwRevSSU
 *   certSwRevR5SBL
 *   certSwRevHSM
 *   certSwRevApp
 *   bootRetryCounts  (bits [7:0] = hsmBootRetryCount, bits [15:8] = sblBootRetryCount)
 *   hsmFirmwareUpdateStatus
 *   sblFirmwareUpdateStatus
 *   c29Cpu1FirmwareUpdateStatus
 *   c29Cpu3FirmwareUpdateStatus
 *
 * Total size: SIZE_OF_SECURITY_DEVICE_CONFIG
 *   F29H85X, F29P32X  = 48 bytes (12 x uint32_t)
 *   Other    = 40 bytes  (10 x uint32_t)
 */
typedef struct DeviceConfigSecurity_t_
{
#if defined (SOC_F29H85X)
    uint32_t c29Cpu2SecCfgValidationStatus; /** C29 CPU-2 Sec-Cfg validation status */
    uint32_t c29Cpu3SecCfgValidationStatus; /** C29 CPU-3 Sec-Cfg validation status */
    uint32_t certSwRevSSU;                  /** Software Revision for SSU from Certificate */
    uint32_t certSwRevR5SBL;                /** Software Revision for R5 SBL from Certificate */
    uint32_t certSwRevHSM;                  /** Software Revision for HSM Runtime from Certificate */
    uint32_t certSwRevApp;                  /** Software Revision for Application from Certificate */
#elif defined (SOC_F29P32X)
    uint32_t c29Cpu2SecCfgValidationStatus; /** C29 CPU-2 Sec-Cfg validation status */
    uint32_t reserved1;                     /** Reserved for alignment */
    uint32_t certSwRevSSU;                  /** Software Revision for SSU from Certificate */
    uint32_t certSwRevR5SBL;                /** Software Revision for R5 SBL from Certificate */
    uint32_t certSwRevHSM;                  /** Software Revision for HSM Runtime from Certificate */
    uint32_t certSwRevApp;                  /** Software Revision for Application from Certificate */
#else
    uint32_t reserved1;                     /** Reserved for alignment */
    uint32_t reserved2;                     /** Reserved for alignment */
    uint32_t reserved3;                     /** Reserved for alignment */
    uint32_t reserved4;                     /** Reserved for alignment */
    uint32_t reserved5;                     /** Reserved for alignment */
    uint32_t reserved6;                     /** Reserved for alignment */
#endif
    uint32_t bootRetryCounts;               /** bits [7:0]  = hsmBootRetryCount,
                                             *  bits [15:8] = sblBootRetryCount,
                                             *  bits [31:16] = reserved */
    uint32_t hsmFirmwareUpdateStatus;       /** HSM firmware update status */
    uint32_t sblFirmwareUpdateStatus;       /** SBL firmware update status */
    uint32_t hostCpu1FirmwareUpdateStatus;  /** Host CPU-1 firmware update status */
    uint32_t hostCpu2FirmwareUpdateStatus;  /** Host CPU-2 (For F29x devices, CPU3) firmware update status */
} DeviceConfigSecurity_t;

/**
 * @brief
 * Debug status structure containing debug access information.
 * Total size: SIZE_OF_DEBUG_DEVICE_CONFIG (16 bytes)
 */
typedef struct DeviceConfigDebug_t_
{
    uint32_t publicDebugStatus;             /** Public debug port open/close status */
    uint32_t publicRegisterAccessStatus;    /** Public debug register access status */
    uint32_t secureDebugStatus;             /** Secure debug port open/close status */
    uint32_t secureRegisterAccessStatus;    /** Secure debug register access status */
} DeviceConfigDebug_t;

/**
 * @brief
 * Keyring configuration structure containing keyring-related device information.
 * Total size: SIZE_OF_KEYRING_DEVICE_CONFIG (20 bytes)
 */
typedef struct DeviceConfigKeyring_t_
{
    uint32_t keyringImportCounter;          /** Overall keyring status/flags */
    uint32_t numAsymmKeysImported;          /** Number of asymmetric auxiliary keys imported */
    uint32_t numSymmKeysImported;           /** Number of symmetric auxiliary keys imported */
    uint32_t numAsymmPrivateKeysImported;   /** Number of Asymmetric auxiliary private keys imported */
    uint32_t customKeyDataPresent;          /** Custom data imported */
} DeviceConfigKeyring_t;

/**
 * @brief
 * This is device configuration read request structure passed to HSM core via SIPC
 * as argument, these parameters are required by the service handler
 *
 * @param configType               [IN] Type of configuration to read (safety/security/debug/all)
 * @param configData               [OUT] Pointer to buffer where device configuration will be stored
 * @param configSize               [IN/OUT] Size of the configuration buffer in bytes (input), actual size returned (output)
 * @param configDataCRC            [OUT] CRC of the configuration data returned by HSM
 */
typedef struct DeviceConfigRead_t_
{
    uint32_t configType;            /** Type of configuration to read */
    uint32_t *configData;           /** Pointer to buffer for device configuration data */
    uint32_t configSize;            /** Size of configuration buffer (input), actual size (output) */
    uint16_t configDataCRC;         /** CRC of configuration data */
} DeviceConfigRead_t;

    /**
     * @brief
     * This API waits for HSMRT load if requested
     * and then waits for boot notification. In case of
     * failure in HSMRT load it returns SystemP_FAILURE.
     *
     * @return
     * 1. SystemP_SUCCESS if HSMRT load is successful.
     * 2. SystemP_FAILURE if HSMRT load fails.
     */
    int32_t HsmClient_checkAndWaitForBootNotification(void);

    /**
     * @brief
     * Initialize the HSM client for current core.
     *
     * @param params [IN] SIPC_notify params.
     *
     * @return
     * 1. SystemP_SUCCESS if init sequence successful.
     * 2. SystemP_FAILURE if init sequence fails.
     */
    int32_t HsmClient_init(SIPC_Params *params);

    /**
     * @brief
     * De initialize the HSM client for current core.
     *
     */
    void HsmClient_deInit(void);

/**
 * @brief
 * Customize the size of the HSM client message queue
 *
 * @param configured_hsm_client_msg_queue_size  Desired size of the HSM client message queue passed by the user.
 */
void HsmClient_SecureBootQueueInit(uint32_t configured_hsm_client_msg_queue_size);
/**
 * @brief
 *  populates the current HSMRT version Id
 *  by default the hsm flag is set to HSM_FLAG_AOP for this service
 *
 * @param timeToWaitInTick  [IN] amount of time to block waiting for
 * semaphore to be available, in units of system ticks (see KERNEL_DPL_CLOCK_PAGE)
 * @param HsmClient         [IN] Client object which is using this getversion API.
 * @param verId             [OUT] populates HsmVer_t struct which describes current version. Pass the pointer returned by HsmClient_prepareHostBuff() to ensure cache-line alignment.
 *
 * @return
 * 1. SystemP_SUCCESS if returns successfully
 * 2. SystemP_FAILURE if NACK message is received or client id not registered.
 * 3. SystemP_TIMEOUT if timeout exception occours.
 */
int32_t HsmClient_getVersion(HsmClient_t *HsmClient ,
                                        HsmVer_t* verId,uint32_t timeToWaitInTick);

    /**
     * @brief
     *  The service issued to HSM Server populates the Device UID
     *  by default the hsm flag is set to HSM_FLAG_AOP for this service
     *
     * @param timeout           [IN] amount of time to block waiting for
     * semaphore to be available, in units of system ticks (see KERNEL_DPL_CLOCK_PAGE)
     * @param HsmClient         [IN] Client object which is using this getUID API.
     * @param uid               [OUT] populates UID value.
     *
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     * 3. SystemP_TIMEOUT if timeout exception occours.
     */
    int32_t HsmClient_getUID(HsmClient_t *HsmClient,
                             uint8_t *uid, uint32_t timeout);

    /**
     * @brief
     *  The service issued to HSM Server verifies the certificate and
     *  by default the hsm flag is set to HSM_FLAG_AOP for this service
     *
     * @param timeout           [IN] amount of time to block waiting for
     * semaphore to be available, in units of system ticks (see KERNEL_DPL_CLOCK_PAGE)
     * @param HsmClient         [IN] Client object which is using this openDbgFirewalls API.
     * @param cert              [IN] point to the location of certificate in the device memory.
     * @param cert_size         [IN] size of certificate.
     *
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     * 3. SystemP_TIMEOUT if timeout exception occours.
     */
    int32_t HsmClient_openDbgFirewall(HsmClient_t *HsmClient,
                                      uint8_t *cert,
                                      uint32_t cert_size,
                                      uint32_t timeout);

    /**
     * @brief
     *  The service issued to HSM Server verifies the certificate and
     *  imports the keys from the certificate
     *
     * @param timeout           [IN] amount of time to block waiting for
     * semaphore to be available, in units of system ticks (see KERNEL_DPL_CLOCK_PAGE)
     * @param HsmClient         [IN] Client object which is using this importKeyring API.
     * @param cert              [IN] point to the location of certificate in the device memory.
     * @param cert_size         [IN] size of certificate.
     *
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     * 3. SystemP_TIMEOUT if timeout exception occours.
     */
    int32_t HsmClient_importKeyring(HsmClient_t *HsmClient,
                                    uint8_t *cert,
                                    uint32_t cert_size,
                                    uint32_t timeout);

    /**
     * @brief
     *  The service issued to HSM Server retrieves the data of GP OTP row
     *  based on row index provided as param.
     *
     * @param HsmClient [IN] HsmClient object.
     * @param readRow   [IN] populates NvmOtpRead_t struct with rowData
     *                       corresponding to rowIdx.
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     */
    int32_t HsmClient_readOTPRow(HsmClient_t *HsmClient,
                                 NvmOtpRead_t *readRow);

    /**
     * @brief
     *  The service issued to HSM Server writes the data to extended
     *  OTP efuse row based on row index provided as param.
     *
     * @param HsmClient  [IN] HsmClient object.
     * @param writeRow   [IN] populates NvmOtpRowWrite_t struct with rowData
     *                       corresponding to rowIdx.
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     */
    int32_t HsmClient_writeOTPRow(HsmClient_t *HsmClient,
                                  NvmOtpRowWrite_t *writeRow);

    /**
     * @brief
     *  The service issued to HSM Server sets the protection status bit of
     *  the specified row to 1. This API is not valid for F29H85x.
     *
     * @param HsmClient [IN] HsmClient object.
     * @param rowProt   [IN] Pointer to NvmOtpRowProt_t struct which contains
     *                       the row index and row protection status
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     */
    int32_t HsmClient_lockOTPRow(HsmClient_t *HsmClient,
                                 NvmOtpRowProt_t *rowProt);

    /**
     * @brief
     *  The service issued to HSM Server retrieves the count of extended OTP
     *  rows.
     *
     * @param HsmClient [IN] HsmClient object.
     * @param rowCount  [IN] Pointer to NvmOtpRowCount_t struct which is
     *                       populated by HSM server with row count and row size
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     */
    int32_t HsmClient_getOTPRowCount(HsmClient_t *HsmClient,
                                     NvmOtpRowCount_t *rowCount);

    /**
     * @brief
     *  The service issued to HSM Server retrieves the extended otp efuse row
     *  protection status. This API is not valid for F29H85x.
     *
     * @param HsmClient [IN] HsmClient object.
     * @param rowProt  [IN]  Pointer to NvmOtpRowProt_t struct which is
     *                       populated by HSM server with row protection status
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     */
    int32_t HsmClient_getOTPRowProtection(HsmClient_t *HsmClient,
                                          NvmOtpRowProt_t *rowProt);

    /**
     * @brief
     *  The service issued to HSM Server helps with extended secure boot for
     *  applications.
     *
     * @param timeout           [IN] amount of time to block waiting for
     * semaphore to be available, in units of system ticks (see KERNEL_DPL_CLOCK_PAGE)
     * @param HsmClient         [IN] Client object which is using this openDbgFirewalls API.
     * @param cert              [IN] point to the location of certificate in the device memory.
     * @param cert_size         [IN] size of certificate.
     *
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     * 3. SystemP_TIMEOUT if timeout exception occours.
     */
    int32_t HsmClient_procAuthBoot(HsmClient_t *HsmClient,
                                   uint8_t *cert,
                                   uint32_t cert_size,
                                   uint32_t timeout);

    /**
     * @brief
     *  The service issued to HSM Server helps with extended secure boot for
     *  applications.
     *
     * @param HsmClient         [IN] Client object which is using this openDbgFirewalls API.
     * @param secureBootInfo    [IN] pointer to the secure boot information object in
     *                               shared memory.
     *
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     * 3. SystemP_TIMEOUT if timeout exception occours.
     */
    int32_t HsmClient_procAuthBootStart(HsmClient_t *HsmClient,
                                        SecureBoot_Stream_t *secureBootInfo);

    /**
     * @brief
     *  The service issued to HSM Server helps with extended secure boot for
     *  applications.
     *
     * @param HsmClient         [IN] Client object which is using this openDbgFirewalls API.
     * @param secureBootInfo    [IN] pointer to the secure boot information object in
     *                               shared memory.
     *
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     * 3. SystemP_TIMEOUT if timeout exception occours.
     */
    int32_t HsmClient_procAuthBootUpdate(HsmClient_t *HsmClient,
                                         SecureBoot_Stream_t *secureBootInfo);

    /**
     * @brief
     *  The service issued to HSM Server helps with extended secure boot for
     *  applications.
     *
     * @param HsmClient         [IN] Client object which is using this openDbgFirewalls API.
     * @param secureBootInfo    [IN] pointer to the secure boot information object in
     *                               shared memory
     *
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     * 3. SystemP_TIMEOUT if timeout exception occours.
     */
    int32_t HsmClient_procAuthBootFinish(HsmClient_t *HsmClient,
                                         SecureBoot_Stream_t *secureBootInfo);

    /**
     * @brief
     *  The service issued to HSM Server sets the firewall for the given firewall id and
     *  region.
     *
     * @param timeout           [IN] amount of time to block waiting for
     * semaphore to be available, in units of system ticks (see KERNEL_DPL_CLOCK_PAGE)
     * @param HsmClient              [IN] HsmClient object.
     * @param FirewallReqObj         [IN] Pointer to FirewallReq_t struct which contains
     *                                    information required for HSM to process set firewall request.
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     * 3. SystemP_TIMEOUT if timeout exception occours.
     */
    int32_t HsmClient_setFirewall(HsmClient_t *HsmClient,
                                  FirewallReq_t *FirewallReqObj,
                                  uint32_t timeout);
    /**
     * @brief
     *  The service issued to HSM Server sets the firewall interrupt request for the given firewall id.
     *
     * @param timeout           [IN] amount of time to block waiting for
     * semaphore to be available, in units of system ticks (see KERNEL_DPL_CLOCK_PAGE)
     * @param HsmClient                  [IN] HsmClient object.
     * @param FirewallIntrReqObj         [IN] Pointer to FirewallIntrReq_t struct which contains
     *                                    information required for HSM to process firewall interrupt
     *                                    request.
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     * 3. SystemP_TIMEOUT if timeout exception occours.
     */
    int32_t HsmClient_FirewallIntr(HsmClient_t *HsmClient,
                                   FirewallIntrReq_t *FirewallIntrReqObj,
                                   uint32_t timeout);

    /**
     * @brief
     * The service issued to HSM Server verifies the certificate and process the keywriter operations,
     * @param HsmClient         [IN] Client object which is using this API.
     * @param certHeader        [IN] point to the location of certificate in the device memory. Pass the pointer returned by HsmClient_prepareHostBuff() to ensure cache-line alignment.
     * @param timeout           [IN] amount of time to block waiting for
     * semaphore to be available, in units of system ticks (see KERNEL_DPL_CLOCK_PAGE)
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     * 3. SystemP_TIMEOUT if timeout exception occours.
     */
    int32_t HsmClient_keyWriter(HsmClient_t *HsmClient,
                                KeyWriterCertHeader_t *certHeader,
                                uint32_t timeout);

    /**
     * @brief
     *  The service issued to HSM Server retrieves the SWRevision value
     *  based on identifier as param.
     *
     * @param HsmClient [IN] HsmClient object.
     * @param readSWRev [IN] populates SWRev_t struct with SWRev value
     *                       corresponding to identifier.
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     */
    int32_t HsmClient_readSWRev(HsmClient_t *HsmClient,
                                SWRev_t *readSWRev);

    /**
     * @brief
     *  The service issued to HSM Server writes the SWRevision value
     *  based on identifier as param.
     *
     * @param HsmClient [IN] HsmClient object.
     * @param writeSWRev [IN] updates the SWRev efuses with SWRev value
     *                       corresponding to identifier.
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     */
    int32_t HsmClient_writeSWRev(HsmClient_t *HsmClient,
                                 SWRev_t *writeSWRev);

    /**
     * @brief
     *  The service issued to HSM Server retrieves the derived KEK
     *  based on identifier as param.
     *
     *  The service issued to HSM Server retrieves the derived KEK.
     *
     * @param timeout           [IN] amount of time to block waiting for
     * semaphore to be available, in units of system ticks (see KERNEL_DPL_CLOCK_PAGE)
     * @param HsmClient         [IN] HsmClient object.
     * @param getDKEK           [IN] Pointer to DKEK_t which contains the request
     *								 structure for Derived KEK.
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     */
    int32_t HsmClient_getDKEK(HsmClient_t *HsmClient,
                              DKEK_t *getDKEK,
                              uint32_t timeout);
    /**
     * @brief
     * register a client to a particular ClientId
     *
     * @param HsmClient [IN] HsmClient object.
     * @param clientId [IN] enable HSM <--> R5 communication for given clientID
     *
     * @return
     * 1. SystemP_SUCCESS if clientId is available
     * 2. SystemP_FAILURE if clientId is not available or already in use.
     */
    int32_t HsmClient_register(HsmClient_t *HsmClient, uint8_t clientId);

    /**
     * @brief
     * unregister a client to a particular ClientId
     *
     * @param HsmClient [IN] HsmClient object
     * @param clientId [IN] disable HSM <--> R5 communication for given clientId
     *
     */
    void HsmClient_unregister(HsmClient_t *HsmClient, uint8_t clientId);

    /**
     * @brief
     * Current core will wait for bootnotify message from HSM core.
     *
     * @param HsmClient [IN] HsmClient object
     *
     * @param timeToWaitInTicks  [IN] amount of time to block waiting for
     * semaphore to be available, in units of SystemP_timeout if timeout exception occours.system ticks (see KERNEL_DPL_CLOCK_PAGE)
     *
     * @return
     * 1. SystemP_SUCCESS -: when BootNotify received
     * 2. SystemP_FAILURE -: if faulty msg received
     */
    int32_t HsmClient_waitForBootNotify(HsmClient_t *HsmClient, uint32_t timeToWaitInTicks);

    /**
     *  @brief  Loads the HSMRt firmware. This is typically called by SBL.
     *
     *  @param gHSMClient         [IN]  Pointer to registered HSM Client
     *
     * @param pHSMRt_firmware     [IN]  Pointer to signed HSMRt binary
     *
     *  @return SystemP_SUCCESS on success, else SystemP_FAILURE
     *
     */
    int32_t Hsmclient_loadHSMRtFirmware(HsmClient_t *gHSMClient, const uint8_t *pHSMRt_firmware);

    /**
     *  @brief  Loads the HSMRt firmware but does wait for ROM response and boot notification.
     *          This is typically called by SBL.
     *
     * @param pHSMRt_firmware     [IN]  Pointer to signed HSMRt binary
     *
     *  @return SystemP_SUCCESS on success, else SystemP_FAILURE
     *
     */
    int32_t Hsmclient_loadHSMRtFirmwareNonBlocking(const uint8_t *pHSMRt_firmware);

