TexasInstruments/mcu_plus_sdk_am263x/source/security/security_common/drivers/hsmclient/hsmclient.h
    /**
     *  @brief  Returns the Random Number Generated.
     *
     *  @param  HsmClient            [IN] HsmClient object
     *  @param getRandomNum          [IN] Pointer to RNGReq_t which contains the request
     *								 structure for Random Number Generated.
     *
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     */
    int32_t HsmClient_getRandomNum(HsmClient_t *HsmClient,
                                   RNGReq_t *getRandomNum);

    /**
     * @brief
     *  service request issued to HSM server to parse the certificate to validate authenticity
     *  and identify the firmware component undergoing update
     *  This service is valid only for F29H85x SOC
     *
     * @param HsmClient                [IN] Client object which is using this API.
     * @param pFirmwareUpdateObject     [IN] Pointer to arguments to be passed to HSM core via SIPC.
     *
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     * 3. SystemP_TIMEOUT if timeout exception occours.
     */
    int32_t HsmClient_firmwareUpdate_CertProcess(HsmClient_t *HsmClient,
                                                 FirmwareUpdateReq_t *pFirmwareUpdateObject);

    /**
     * @brief
     *  service request issued to HSM server to program the incoming firmware to device dormant banks
     *  This service is valid only for F29H85x SOC
     *
     * @param HsmClient                [IN] Client object which is using this API.
     * @param pFirmwareUpdateObject     [IN] Pointer to arguments to be passed to HSM core via SIPC.
     *
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     * 3. SystemP_TIMEOUT if timeout exception occours.
     */
    int32_t HsmClient_firmwareUpdate_CodeProgram(HsmClient_t *HsmClient,
                                                 FirmwareUpdateReq_t *pFirmwareUpdateObject);

    /**
     * @brief
     *  service request issued to HSM server to decrypt the firmware programmed in dormant flash bank in place,
     *  perform integrity checks on the decrypted firmware and program the certificate in flash memory
     *  This service is valid only for F29H85x SOC
     *
     * @param HsmClient                [IN] Client object which is using this API.
     * @param pFirmwareUpdateObject     [IN] Pointer to arguments to be passed to HSM core via SIPC.
     *
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     * 3. SystemP_TIMEOUT if timeout exception occours.
     */
    int32_t HsmClient_firmwareUpdate_CodeVerify(HsmClient_t *HsmClient,
                                                FirmwareUpdateReq_t *pFirmwareUpdateObject);

    /**
     * @brief
     *  service request issued to HSM server to validate RoT Switching Certificate
     *
     * @param timeout           [IN] amount of time to block waiting for
     * semaphore to be available, in units of system ticks (see KERNEL_DPL_CLOCK_PAGE)
     * @param HsmClient         [IN] Client object which is using this RoT Switching API.
     * @param cert              [IN] point to the location of certificate in the device memory.
     * @param cert_size         [IN] size of certificate.
     *
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     * 3. SystemP_TIMEOUT if timeout exception occours.
     */
    int32_t HsmClient_VerifyROTSwitchingCertificate(HsmClient_t *HsmClient,
                                  uint8_t *cert,
                                  uint32_t cert_size,
                                  uint32_t timeout);

    /**
     * @brief
     *  service request issued to HSM server to update key revision to 0x2 which changes the root of trust key from
     *  secondary keys to back up keys.
     *
     * @param timeout           [IN] amount of time to block waiting for
     * semaphore to be available, in units of system ticks (see KERNEL_DPL_CLOCK_PAGE)
     * @param HsmClient         [IN] Client object which is using this RoT Switching API.
     *
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     * 3. SystemP_TIMEOUT if timeout exception occours.
     */
    int32_t HsmClient_UpdateKeyRevsion(HsmClient_t *HsmClient,
                                       uint32_t timeout);

    /**
     * @brief
     *  Send FA transition certificate to HSM to permanently enable FA mode.
     *  IRREVERSIBLE — writes FA_EN to OTP. Only valid on HS-SE/HS-KP devices.
     *
     * @param timeout           [IN] amount of time to block waiting for
     * semaphore to be available, in units of system ticks (see KERNEL_DPL_CLOCK_PAGE)
     * @param HsmClient         [IN] Client object which is using this FA Transition API.
     * @param cert              [IN] point to the location of FA transition certificate in the device memory.
     * @param cert_size         [IN] size of certificate.
     *
     * @return
     * 1. SystemP_SUCCESS if returns successfully
     * 2. SystemP_FAILURE if NACK message is received or client id not registered.
     * 3. SystemP_TIMEOUT if timeout exception occours.
     */
    int32_t HsmClient_EnableFATransition(HsmClient_t *HsmClient,
                                         uint8_t *cert,
                                         uint32_t cert_size,
                                         uint32_t timeout);

/**
 *  @brief  Client request to configure the OTFA regions
 *
 *  @param  HsmClient        [IN] HsmClient object
 *  @param  OTFA_ConfigInfo  [IN] OTFA Config Info
 *  @param  timeout          [IN] timeout
 * 
 * @return
 * 1. SystemP_SUCCESS if returns successfully
 * 2. SystemP_FAILURE if NACK message is received or client id not registered.
 */
int32_t HsmClient_configOTFARegions(HsmClient_t* HsmClient,
                                        OTFA_Config_t* OTFA_ConfigInfo,
                                        uint32_t timeout);

/**
 *  @brief  Client request to read the OTFA regions
 *
 *  @param  HsmClient        [IN] HsmClient object
 *  @param  OTFA_readRegion  [IN] OTFA Read Region
 *  @param  timeout          [IN] timeout
 * 
 * @return
 * 1. SystemP_SUCCESS if reading done successfully
 * 2. SystemP_FAILURE if NACK message is received or client id not registered.
 */
int32_t HsmClient_readOTFARegions(HsmClient_t* HsmClient,
                                        OTFA_readRegion_t* OTFA_readRegion,
                                        uint32_t timeout);

/**
 *  @brief  Client request to validate sec-cfg
 *  Valid only for F29x family of devices
 *
 *  @param  HsmClient       [IN] HsmClient object
 *  @param  pSecCfgParams   [IN] Sec-Cfg object
 *  @param  timeout         [IN] timeout
 * 
 * @return
 * 1. SystemP_SUCCESS if validation done successfully
 * 2. SystemP_FAILURE if NACK message is received or client id not registered.
 */
int32_t HsmClient_secCfgValidate(HsmClient_t *HsmClient,
                                 SecCfgValidate_t *pSecCfgParams,
                                 uint32_t timeout);

/**
 *  @brief  Client request to copy active flash bank contents 
 *          to dormant flash bank
 *  Valid only for F29x family of devices
 *
 *  @param  HsmClient               [IN] HsmClient object
 *  @param  pFlashBankCopyObject    [IN] Flash Bank copy object
 *  @param  timeout                 [IN] timeout
 * 
 * @return
 * 1. SystemP_SUCCESS if copy done successfully
 * 2. SystemP_FAILURE if NACK message is received or client id not registered.
 */
int32_t HsmClient_activeToDormantBankCopy(HsmClient_t *HsmClient,
                                          FlashBankCopy_t *pFlashBankCopyObject,
                                          uint32_t timeout);

/**
 *  @brief  Client request to update device Sec-Cfg
 *          Valid only for F29x family of devices
 *
 *  @param  HsmClient               [IN] HsmClient object
 *  @param pFirmwareUpdateObject     [IN] Pointer to arguments to be passed to HSM core via SIPC.
 * 
 * @return
 * 1. SystemP_SUCCESS if copy done successfully
 * 2. SystemP_FAILURE if NACK message is received or client id not registered.
 */
int32_t HsmClient_SecCfgUpdate(HsmClient_t *HsmClient,
                                            FirmwareUpdateReq_t *pFirmwareUpdateObject);
 
 /**
 * @brief
 *  Client request to get device configuration from HSM
 *  This is a blocking call that waits for HSM response
 *
 * @param HsmClient                 [IN] HsmClient object
 * @param pDeviceConfigObject       [IN] Pointer to device config read request structure
 * @param timeout                   [IN] Timeout in system ticks
 *
 * @return
 * 1. SystemP_SUCCESS if operation successful
 * 2. SystemP_FAILURE if NACK received or client not registered
 * 3. SystemP_TIMEOUT if timeout occurs
 */
int32_t HsmClient_getDeviceConfig(HsmClient_t *HsmClient,
                                   DeviceConfigRead_t *pDeviceConfigObject,
                                   uint32_t timeout);

/**
 * @brief  Submit a generic crypto service request to the HSM.
 *         Set svcReq->algoId to the algorithm (HSM_CRYPTO_SVC_MAC_CMAC, etc.)
 *         and svcReq->subSvcId to the operation (HSM_CRYPTO_SVC_MAC_GENERATE,
 *         etc.). Set svcReq->keyId to the keyring index and point svcReq->ptrArgs
 *         at the corresponding args struct (e.g. CMACArgs_t).
 *
 * @param HsmClient  [IN]     HsmClient object
 * @param svcReq     [IN/OUT] Pointer to CryptoServiceReq_t; for generate
 *                            operations, output is written to ptrTag on success
 * @param respReq    [IN/OUT] Pointer to CryptoServiceReq_t; the errCode is written
 *                            to this pointer
 * @param timeout    [IN]     Timeout in ticks (SystemP_WAIT_FOREVER to block)
 *
 * @return SystemP_SUCCESS on ACK, SystemP_FAILURE on NACK or error.
 */
int32_t HsmClient_CryptoService(HsmClient_t *HsmClient,
                                 CryptoServiceReq_t *svcReq,
                                 CryptoServiceReq_t *respReq,
                                 uint32_t timeout);

/**
 *  @brief  Client request to Swap C29 CPU flash banks
 *          Valid only for F29x family of devices
 *
 *  @param  HsmClient               [IN] HsmClient object
 *  @param  pBankSwapObject         [IN] Pointer to arguments to be passed to HSM core via SIPC.
 * 
 * @return
 * 1. SystemP_SUCCESS if message sent successfully
 * 2. SystemP_FAILURE if message not sent.
 */
int32_t HsmClient_runTimeBankSwap(HsmClient_t *HsmClient,
                            BankSwapReq_t *pBankSwapObject);

/** @} */

#ifdef __cplusplus
}
#endif

#endif /* HSM_CLIENT_H_ */
